Inserts a point into the stream and associated buffer.
  Namespace:   Autodesk.Revit.DB.DirectContext3D
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2017
 Syntax
  C#
public void AddPoint(
	IndexPoint point
)
  Visual Basic
Public Sub AddPoint ( _
	point As IndexPoint _
)
  Visual C++
public:
void AddPoint(
	IndexPoint^ point
)
 Parameters
  point
 Type:  Autodesk.Revit.DB.DirectContext3D IndexPoint
 The point to be inserted.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions InvalidOperationException   |   Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
 See Also
  IndexStreamPoint Class
  Autodesk.Revit.DB.DirectContext3D Namespace